""" Создайте функцию greeting, которая внутри выводит приветственное 
сообщение print('Hello world!'). И вызовите ее. """

def greeting_func ():
    print('Hello world!')
greeting_func ()